In [144]:
import pandas as pd
import numpy as np

In [145]:
ml=[55,25,75,40,90]
mlarr=np.array(ml)

In [146]:
sl=pd.Series(ml)
sl

0    55
1    25
2    75
3    40
4    90
dtype: int64

In [147]:
slarr=pd.Series(mlarr)
slarr

0    55
1    25
2    75
3    40
4    90
dtype: int32

In [148]:
sl=pd.Series(ml,index=["a",'b','c','d','e'])
sl

a    55
b    25
c    75
d    40
e    90
dtype: int64

In [149]:
slu=sl+2.5
slu

a    57.5
b    27.5
c    77.5
d    42.5
e    92.5
dtype: float64

In [150]:
slu-sl

a    2.5
b    2.5
c    2.5
d    2.5
e    2.5
dtype: float64

In [151]:
#df

In [152]:
stu=['Mary',"Peter","Susan"]
df1=pd.DataFrame(stu,columns=["Student"])
df1

  Student
0    Mary
1   Peter
2   Susan

In [153]:
grades=["B-","A+","C"]
df2=pd.DataFrame({"Student":stu,"Grade":grades})
df2

  Student Grade
0    Mary    B-
1   Peter    A+
2   Susan     C

In [154]:
df2['Num']=[10,11,12]
df2

  Student Grade  Num
0    Mary    B-   10
1   Peter    A+   11
2   Susan     C   12

In [155]:
df3=pd.DataFrame({"sl":sl,"slarr":slarr})
df3

     sl  slarr
a  55.0    NaN
b  25.0    NaN
c  75.0    NaN
d  40.0    NaN
e  90.0    NaN
0   NaN   55.0
1   NaN   25.0
2   NaN   75.0
3   NaN   40.0
4   NaN   90.0

In [156]:
n1=np.random.randn(5)
n2=np.random.randn(5)
df4=pd.DataFrame({"1":n1,"2":n2})
df4

          1         2
0  1.327922  1.611423
1 -1.233196 -0.228430
2  0.308154  0.364557
3 -0.518397  1.977553
4 -0.174141 -0.030357

In [157]:
n1=np.random.randn(5,2)
df4=pd.DataFrame(n1,columns=[1,2])
df4

          1         2
0 -1.067404  0.289673
1  0.388048  1.316425
2  2.290424 -0.854616
3 -1.357759 -0.266229
4 -0.264728  0.923155

In [158]:
df2

  Student Grade  Num
0    Mary    B-   10
1   Peter    A+   11
2   Susan     C   12

In [159]:
df2[:3]

  Student Grade  Num
0    Mary    B-   10
1   Peter    A+   11
2   Susan     C   12

In [160]:
df2[::-1]

  Student Grade  Num
2   Susan     C   12
1   Peter    A+   11
0    Mary    B-   10

In [161]:
df2.iloc[1:4,1:4]

  Grade  Num
1    A+   11
2     C   12

In [162]:
df2.loc[:,:"Grade"]

  Student Grade
0    Mary    B-
1   Peter    A+
2   Susan     C

In [163]:
df2.loc[[0,2],["Student","Grade"]]

  Student Grade
0    Mary    B-
2   Susan     C

In [164]:
df2.iloc[[1,1],[0,2]]

  Student  Num
1   Peter   11
1   Peter   11

In [165]:
cdf=df2.copy()

In [166]:
cdf.drop(["Grade","Num"],axis=1,inplace=True)#inplace is like commit
cdf

  Student
0    Mary
1   Peter
2   Susan

In [167]:
df2

  Student Grade  Num
0    Mary    B-   10
1   Peter    A+   11
2   Susan     C   12

In [168]:
df2.drop(1,axis=0,inplace=True)

In [169]:
df2.reset_index(inplace=True)
df2

   index Student Grade  Num
0      0    Mary    B-   10
1      2   Susan     C   12

In [170]:
df2.stack()

0  index          0
   Student     Mary
   Grade         B-
   Num           10
1  index          2
   Student    Susan
   Grade          C
   Num           12
dtype: object

In [171]:
df3

     sl  slarr
a  55.0    NaN
b  25.0    NaN
c  75.0    NaN
d  40.0    NaN
e  90.0    NaN
0   NaN   55.0
1   NaN   25.0
2   NaN   75.0
3   NaN   40.0
4   NaN   90.0

In [172]:
df3.reset_index()

  index    sl  slarr
0     a  55.0    NaN
1     b  25.0    NaN
2     c  75.0    NaN
3     d  40.0    NaN
4     e  90.0    NaN
5     0   NaN   55.0
6     1   NaN   25.0
7     2   NaN   75.0
8     3   NaN   40.0
9     4   NaN   90.0

In [174]:
df2.unstack()

index    0        0
         1        2
Student  0     Mary
         1    Susan
Grade    0       B-
         1        C
Num      0       10
         1       12
dtype: object

In [175]:
df2.melt()

  variable  value
0    index      0
1    index      2
2  Student   Mary
3  Student  Susan
4    Grade     B-
5    Grade      C
6      Num     10
7      Num     12

In [176]:

data_cust = pd.DataFrame({"customerID":['101','102','103','104'],
                          'category': ['Medium','Medium', 'High','Low'],
                          'first_visit': ['yes','no', 'yes','yes'],
                          'sales': [123,52,214,663]}, index=[0,1,2,3])

data_cust_new = pd.DataFrame({"customerID": ['101','103','104','105'],
                              'distance': [12,9,44,21],
                              'sales': [123,214,663,331]}, index=[4,5,6,7])

In [180]:
print(data_cust)

data_cust_new

  customerID category first_visit  sales
0        101   Medium         yes    123
1        102   Medium          no     52
2        103     High         yes    214
3        104      Low         yes    663

  customerID  distance  sales
4        101        12    123
5        103         9    214
6        104        44    663
7        105        21    331

In [192]:
pd.concat([data_cust,data_cust_new],axis=0)

  customerID category first_visit  sales  distance
0        101   Medium         yes    123       NaN
1        102   Medium          no     52       NaN
2        103     High         yes    214       NaN
3        104      Low         yes    663       NaN
4        101      NaN         NaN    123      12.0
5        103      NaN         NaN    214       9.0
6        104      NaN         NaN    663      44.0
7        105      NaN         NaN    331      21.0

In [194]:
pd.merge(data_cust,data_cust_new,how="inner",on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes      123        12      123
1        103     High         yes      214         9      214
2        104      Low         yes      663        44      663

In [195]:
pd.merge(data_cust,data_cust_new,how="outer",on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes    123.0      12.0    123.0
1        102   Medium          no     52.0       NaN      NaN
2        103     High         yes    214.0       9.0    214.0
3        104      Low         yes    663.0      44.0    663.0
4        105      NaN         NaN      NaN      21.0    331.0

In [196]:
pd.merge(data_cust,data_cust_new,how="left",on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes      123      12.0    123.0
1        102   Medium          no       52       NaN      NaN
2        103     High         yes      214       9.0    214.0
3        104      Low         yes      663      44.0    663.0

In [197]:
pd.merge(data_cust,data_cust_new,how="right",on="customerID")

  customerID category first_visit  sales_x  distance  sales_y
0        101   Medium         yes    123.0        12      123
1        103     High         yes    214.0         9      214
2        104      Low         yes    663.0        44      663
3        105      NaN         NaN      NaN        21      331